Tekla.Structures.Solid.Face
The Face class represents a single face in a solid.

Tekla.Structures.Solid.Face.#ctor(System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}},Tekla.Structures.Internal.dotPoint_t,System.Int32,Tekla.Structures.Identifier)
Instantiates a new face.
LoopList: A list of loops in the new face.
NormalVector: A normal vector of the new face.
ShellIndex: Index of the shell.
OriginPartId: The origin part identifier.

Tekla.Structures.Solid.Face.Normal
The normal vector of the face.

Tekla.Structures.Solid.Face.ShellIndex
The shell index of the face.

Tekla.Structures.Solid.Face.OriginPartId
The part id of the part that this face originated from.
For example, a face create by a part cut has the id of the cutting part.

Tekla.Structures.Solid.Face.GetLoopEnumerator
Gets a new loop enumerator for enumerating through the face's loops.
Returns: The new loop enumerator.